{
  "backend/main.mo": "Motoko canister handling user profiles, access control, and CRUD operations for Facebook outreach entries with attachments and timestamps.",
  "feature_evidence.json": "Feature evidence report linking implemented UI features to source files, components, and test requirements.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Global Tailwind-based styles defining OKLCH color variables, theming, and base typography for light and dark modes.",
  "frontend/index.html": "Base HTML document mounting the React app via the root div and main.tsx script.",
  "frontend/src/App.tsx": "Main React app component managing navigation between Dashboard and Hook Library within theme and query providers.",
  "frontend/src/components/dashboard/DaysSinceLastPostCard.tsx": "Dashboard card computing days since last post per group and displaying results in a sortable table with warning colors.",
  "frontend/src/components/dashboard/FollowUpTodayList.tsx": "Dashboard list showing entries requiring follow‑up today with status badges, links, and quick edit actions.",
  "frontend/src/components/dashboard/SuccessRateChart.tsx": "Displays a bar-style chart of groups sorted by success count, or a placeholder message if no data is provided.",
  "frontend/src/components/dashboard/WinningPostsCard.tsx": "Shows posts with more than five comments, sorted by engagement, or a fallback message when none exist.",
  "frontend/src/components/entries/DeleteEntryConfirm.tsx": "Confirmation dialog for deleting an outreach entry, calling a delete mutation and showing toast feedback.",
  "frontend/src/components/entries/EntriesTable.tsx": "Renders a table of outreach entries with status badges, actions, and delete/edit options.",
  "frontend/src/components/entries/EntryFormDialog.tsx": "Form dialog for creating or editing an entry, handling validation, image uploads, and loading group notes.",
  "frontend/src/components/entries/entryFormValidation.ts": "Provides URL and non‑negative number validators returning structured validation results.",
  "frontend/src/components/entries/ImageUploadField.tsx": "UI component for selecting, previewing, replacing, or removing an image file in entry forms.",
  "frontend/src/components/entries/responseStatusLabels.ts": "Defines response status options and functions to map statuses to labels and CSS style classes.",
  "frontend/src/components/layout/AppLayout.tsx": "UI layout component providing header, navigation, main content, and footer structure for the app.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to Internet Identity and refreshes queries when identity changes.",
  "frontend/src/hooks/useAdminTokenActor.ts": "Creates an anonymous actor initialized with an admin token when present.",
  "frontend/src/hooks/useAnonymousActor.ts": "Provides a simple anonymous backend actor for unauthenticated access.",
  "frontend/src/hooks/useAuthorizedActor.ts": "Determines the current auth mode and selects the correct actor, exposing readiness and context keys.",
  "frontend/src/hooks/useHookTemplateLibrary.ts": "Fetches and saves hook templates using the authorized actor and React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication lifecycle, storing identity and providing login utilities.",
  "frontend/src/hooks/useOutreachMutations.ts": "Defines mutations for creating, updating, deleting outreach entries and saving group notes.",
  "frontend/src/hooks/useOutreachQueries.ts": "Provides queries for outreach entries, follow‑ups, group summaries, and notes using the authorized actor.",
  "frontend/src/index.css": "Defines Tailwind layers and theme CSS variables for light/dark modes with OKLCH colors and base styles.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity providers and mounts App.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the main dashboard with entries, charts, reminders, and entry form dialog, handling loading and auth states.",
  "frontend/src/pages/HookTemplateLibraryPage.tsx": "Displays and edits three hook templates with save, copy, and loading/error handling using backend hooks.",
  "frontend/src/utils/dateFormat.ts": "Provides helper functions to format dates for display, inputs, and backend storage.",
  "frontend/src/utils/imageFile.ts": "Validates image files, converts files to Uint8Array, and creates preview URLs for uploads.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme with OKLCH color variables, custom fonts, radii, shadows, animations, and plugins.",
  "project_state.json": "Defines the project’s current version, feature set, architectural notes, and known auth-related issues for a marketing tracker web app. Highlights dashboard requirements, response status constraints, and recurring identity/session mismatches between frontend and backend."
}