{
  "backend/main.mo": "Main canister actor implementing access control, blob storage mixins, user profiles, and full CRUD for FacebookOutreachEntry including leadContactInfo and sorting helpers.",
  "backend/migration.mo": "Migration module converting stored FacebookOutreachEntry records by adding the new leadContactInfo field with a default empty string.",
  "feature_evidence.json": "Feature evidence report documenting the leadContactInfo addition and affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing their responsibilities and components.",
  "frontend/docs/live-smoke-test.md": "Manual smoke‑test checklist for validating anonymous‑mode functionality and dashboard behavior in the live environment.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables and light/dark theme tokens for global styling.",
  "frontend/index.html": "Base HTML entry point that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Top‑level React component configuring theme, React Query, layout, and view switching between dashboard and hook library.",
  "frontend/src/components/dashboard/DaysSinceLastPostCard.tsx": "Dashboard card that groups entries by URL, calculates days since most recent post, and displays them in a table with color‑coded indicators.",
  "frontend/src/components/dashboard/EventTypeInquiryRankingCard.tsx": "Displays inquiry counts by event type, sorted and ranked, with a no‑data message fallback.",
  "frontend/src/components/dashboard/FollowUpTodayList.tsx": "Shows Facebook outreach entries requiring follow‑up today with edit actions and group info.",
  "frontend/src/components/dashboard/SuccessRateChart.tsx": "Renders a bar chart of groups sorted by successful engagements with a no‑data fallback.",
  "frontend/src/components/dashboard/WinningPostsCard.tsx": "Lists posts with more than five comments, sorted by engagement, or shows an empty state.",
  "frontend/src/components/entries/DeleteEntryConfirm.tsx": "Confirmation dialog for deleting an outreach entry using mutation hooks with loading and error handling.",
  "frontend/src/components/entries/EntriesTable.tsx": "Displays a detailed table of outreach entries with actions, status badges, and delete confirmation handling.",
  "frontend/src/components/entries/entryCategoryOptions.ts": "Defines craft category options and a helper to map category enums to display labels.",
  "frontend/src/components/entries/entryEventTypeOptions.ts": "Provides event type options and a label lookup for event type enums.",
  "frontend/src/components/entries/EntryFormDialog.tsx": "Dialog form for creating or editing outreach entries with validation, image handling, and backend mutations.",
  "frontend/src/components/entries/entryFormValidation.ts": "Contains simple validators for URLs and non‑negative numeric values.",
  "frontend/src/components/entries/entryInterestOptions.ts": "Defines interest type options and a function to get readable labels for them.",
  "frontend/src/components/entries/ImageUploadField.tsx": "React component for selecting, previewing, replacing, and clearing an uploaded image with optional existing image display.",
  "frontend/src/components/entries/responseStatusLabels.ts": "Maps response status enums to display labels and style class strings.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with header, navigation, content container, and footer including smoke‑test link.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor based on Internet Identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useAdminTokenActor.ts": "Creates an anonymous actor initialized with an admin token from URL parameters.",
  "frontend/src/hooks/useAnonymousActor.ts": "Creates and exposes a backend actor for fully anonymous access.",
  "frontend/src/hooks/useAuthorizedActor.ts": "Determines auth mode (authenticated, admin token, anonymous) and selects the correct actor with readiness signals.",
  "frontend/src/hooks/useBackendHealth.ts": "Checks backend health using the authorized actor with retries and short cache time.",
  "frontend/src/hooks/useHookTemplateLibrary.ts": "Fetches and saves hook templates scoped to the current auth context via React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login, state, and AuthClient initialization.",
  "frontend/src/hooks/useOutreachMutations.ts": "Defines React Query mutation hooks for creating, updating, deleting, and saving notes for outreach entries using an authorized backend actor.",
  "frontend/src/hooks/useOutreachQueries.ts": "Provides React Query hooks for fetching outreach-related data such as entries, follow-ups, summaries, notes, and inquiry stats.",
  "frontend/src/index.css": "Sets Tailwind base styles and defines light/dark mode CSS variables for the app’s color system.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/DashboardPage.tsx": "Implements the main dashboard showing outreach data, charts, follow-ups, and entry management with backend health checks.",
  "frontend/src/pages/HookTemplateLibraryPage.tsx": "Provides a page for viewing, editing, copying, and saving hook templates with backend health handling.",
  "frontend/src/utils/canisterErrors.ts": "Provides helpers to detect stopped-canister and authorization errors and returns user-friendly messages.",
  "frontend/src/utils/clipboard.ts": "Implements a robust copy-to-clipboard function using modern and fallback methods.",
  "frontend/src/utils/dateFormat.ts": "Includes utilities for formatting dates for display, backend queries, and HTML date inputs.",
  "frontend/src/utils/imageFile.ts": "Validates image files, converts them to Uint8Array, and creates preview URLs with cleanup.",
  "frontend/src/utils/urlParams.ts": "Handles extracting, storing, persisting, and clearing URL parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, containers, animations, and plugin integrations.",
  "project_state.json": "Describes the current project state, requirements, issues, and architectural notes for the marketing tracker app."
}