{
  "backend/main.mo": "Motoko canister implementing access-controlled user profiles and CRUD operations for Facebook outreach entries with categories, interests, attachments, and owner tracking.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, affected files, components, and test IDs for recent frontend and backend changes.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and functionality of each major frontend file.",
  "frontend/docs/live-smoke-test.md": "Smoke test checklist for verifying Live deployment behavior, anonymous access, UI features, and backend health handling.",
  "frontend/index.css": "Tailwind-based global stylesheet defining color tokens, theming, and base styling for light and dark modes.",
  "frontend/index.html": "Base HTML document that mounts the React app and loads the main TypeScript bundle.",
  "frontend/src/App.tsx": "Root React component managing navigation between Dashboard and Hook Library and setting up theme and query providers.",
  "frontend/src/components/dashboard/DaysSinceLastPostCard.tsx": "Dashboard card grouping entries by source and showing days since last post with color‑coded indicators.",
  "frontend/src/components/dashboard/FollowUpTodayList.tsx": "Displays today's follow‑up reminders with entry details and an edit button, or a placeholder when none exist.",
  "frontend/src/components/dashboard/SuccessRateChart.tsx": "Renders a bar chart showing groups ranked by count of successful engagements, with fallback text when no data is available.",
  "frontend/src/components/dashboard/WinningPostsCard.tsx": "Shows top posts with more than five comments, sorted by engagement, or a message when none qualify.",
  "frontend/src/components/entries/DeleteEntryConfirm.tsx": "Confirmation dialog for deleting an outreach entry using mutations and toast feedback.",
  "frontend/src/components/entries/EntriesTable.tsx": "Displays a table of outreach entries with details and actions, including edit and delete via a confirmation dialog.",
  "frontend/src/components/entries/entryCategoryOptions.ts": "Defines craft category options and a helper to get their labels.",
  "frontend/src/components/entries/EntryFormDialog.tsx": "A dialog form for creating or editing outreach entries, handling validation, image upload, notes, and mutations.",
  "frontend/src/components/entries/entryFormValidation.ts": "Contains validation helpers for URLs and non‑negative numeric fields.",
  "frontend/src/components/entries/entryInterestOptions.ts": "Defines interest option labels and a helper to map TypeOfInterest values to display text.",
  "frontend/src/components/entries/ImageUploadField.tsx": "Provides UI for selecting, previewing, replacing, or removing an image file within an entry form.",
  "frontend/src/components/entries/responseStatusLabels.ts": "Provides label and style mappings for ResponseStatus enum values.",
  "frontend/src/components/layout/AppLayout.tsx": "Implements the main app layout with header, navigation, content area, and footer.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor based on Internet Identity state and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useAdminTokenActor.ts": "Creates an anonymous actor initialized with an admin token when present.",
  "frontend/src/hooks/useAnonymousActor.ts": "Creates a simple anonymous backend actor for unauthenticated access.",
  "frontend/src/hooks/useAuthorizedActor.ts": "Determines auth mode and selects the appropriate backend actor across authenticated, admin-token, and anonymous states.",
  "frontend/src/hooks/useBackendHealth.ts": "Fetches backend health status using the authorized actor with retry and short cache timing.",
  "frontend/src/hooks/useHookTemplateLibrary.ts": "Provides queries and mutations for loading and saving hook templates via the authorized actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, loading stored identities, and exposing login state.",
  "frontend/src/hooks/useOutreachMutations.ts": "Defines mutations for creating, updating, deleting outreach entries and saving group notes with cache invalidation.",
  "frontend/src/hooks/useOutreachQueries.ts": "Defines React Query hooks for fetching outreach entries, follow-ups, group summaries, and group notes using an authorized backend actor.",
  "frontend/src/index.css": "Configures Tailwind base styles and defines light/dark theme CSS variables with utility classes.",
  "frontend/src/main.tsx": "Initializes the React app root with QueryClient and Internet Identity providers.",
  "frontend/src/pages/DashboardPage.tsx": "Implements the main dashboard UI, loading outreach data and backend health while handling errors and entry management.",
  "frontend/src/pages/HookTemplateLibraryPage.tsx": "Provides UI for editing, saving, and copying hook templates with backend health checks and error handling.",
  "frontend/src/utils/canisterErrors.ts": "Utility functions to detect canister-related and authorization errors and produce user-friendly messages.",
  "frontend/src/utils/clipboard.ts": "Implements robust clipboard copy functionality with modern and legacy fallbacks.",
  "frontend/src/utils/dateFormat.ts": "Provides utilities for formatting dates for display, backend storage, and input fields.",
  "frontend/src/utils/imageFile.ts": "Validates image files, converts them to byte arrays, and creates preview URLs.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters (including hash routing), persisting them in sessionStorage, and removing them from the URL.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, typography, containers, animations, and plugins for the frontend.",
  "project_state.json": "Project metadata describing the app’s purpose, architecture notes, known issues, and a list of existing features for planning and fixes."
}