{
  "backend/main.mo": "Main Motoko canister implementing access control, blob storage mixins, and full CRUD for FacebookOutreachEntry plus user profile management.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of major frontend files and components.",
  "frontend/docs/live-smoke-test.md": "Live environment smoke test checklist covering backend health, anonymous dashboard access, entry creation, and navigation.",
  "frontend/index.css": "Global Tailwind-based styles defining light/dark theme variables using OKLCH color tokens.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top-level React component handling view navigation between dashboard and hook library with providers for theme and React Query.",
  "frontend/src/components/dashboard/DaysSinceLastPostCard.tsx": "Dashboard card computing days since last post per group and displaying a sorted table with color-coded indicators.",
  "frontend/src/components/dashboard/EventTypeInquiryRankingCard.tsx": "Displays inquiry counts by event type, sorted descending, and shows rankings or an empty state message.",
  "frontend/src/components/dashboard/FollowUpTodayList.tsx": "Shows today's follow‑up Facebook outreach entries with status, dates, links, and an edit option.",
  "frontend/src/components/dashboard/SuccessRateChart.tsx": "Renders a bar-style chart ranking groups by successful engagements based on post counts.",
  "frontend/src/components/dashboard/WinningPostsCard.tsx": "Lists posts with more than five comments, sorted by engagement, or shows an empty message.",
  "frontend/src/components/entries/DeleteEntryConfirm.tsx": "Confirmation dialog that deletes an outreach entry via mutation and shows success or error toasts.",
  "frontend/src/components/entries/EntriesTable.tsx": "Displays all outreach entries in a sortable table with thumbnails, metadata, actions, and deletion support.",
  "frontend/src/components/entries/entryCategoryOptions.ts": "Defines craft category options and a helper to map CraftCategory values to labels.",
  "frontend/src/components/entries/entryEventTypeOptions.ts": "Defines event type options and a helper to map EventType values to labels.",
  "frontend/src/components/entries/EntryFormDialog.tsx": "Modal form for creating or editing outreach entries with validation, image handling, and group notes loading.",
  "frontend/src/components/entries/entryFormValidation.ts": "Provides simple validation helpers for URLs and non‑negative numeric inputs.",
  "frontend/src/components/entries/entryInterestOptions.ts": "Defines interest type options and a helper to map TypeOfInterest values to labels.",
  "frontend/src/components/entries/ImageUploadField.tsx": "React component providing image upload, camera capture, preview, and clear controls via hidden file inputs.",
  "frontend/src/components/entries/responseStatusLabels.ts": "Maps response statuses to labels and style classes for UI display.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with header, navigation, content area, and footer including smoke‑test link.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor based on Internet Identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useAdminTokenActor.ts": "Creates an anonymous actor initialized with an admin token for privileged access.",
  "frontend/src/hooks/useAnonymousActor.ts": "Provides a backend actor with no identity or admin token for guest access.",
  "frontend/src/hooks/useAuthorizedActor.ts": "Combines identity, admin token, and anonymous modes to expose the correct backend actor and auth state.",
  "frontend/src/hooks/useBackendHealth.ts": "Checks backend health using the authorized actor with retries and short cache times.",
  "frontend/src/hooks/useHookTemplateLibrary.ts": "Fetches and saves hook templates using the authorized actor with React Query caching.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status flags. Wraps AuthClient creation with custom options and exposes a hook to access auth state.",
  "frontend/src/hooks/useOutreachMutations.ts": "Defines React Query mutations for creating, updating, deleting outreach entries and saving group notes through an authorized actor. Automatically invalidates outreach queries on success.",
  "frontend/src/hooks/useOutreachQueries.ts": "Implements React Query hooks to fetch outreach entries, follow‑ups, group summaries, group notes, and inquiry summaries using an authorized actor. Uses structured query keys and enables queries only when authorization is ready.",
  "frontend/src/index.css": "Configures Tailwind base styles and theme variables for light and dark modes. Adds global styling for borders, body colors, and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app by rendering it with QueryClientProvider and InternetIdentityProvider. Loads global styles and initializes the QueryClient.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the main dashboard showing outreach data, charts, and follow‑ups, with health checks gating backend queries. Supports adding and editing entries via a dialog.",
  "frontend/src/pages/HookTemplateLibraryPage.tsx": "Manages a library of hook templates with load, edit, save, and copy functionality. Performs backend health checks and handles stopped canister errors during template fetching.",
  "frontend/src/utils/canisterErrors.ts": "Provides helpers to detect stopped canister and authorization errors and returns user-friendly messages.",
  "frontend/src/utils/clipboard.ts": "Implements robust text copy-to-clipboard logic with modern API and execCommand fallback.",
  "frontend/src/utils/dateFormat.ts": "Supplies date formatting helpers for backend queries, display formatting, and input normalization.",
  "frontend/src/utils/imageFile.ts": "Validates image files, converts them to Uint8Array, and creates temporary preview URLs.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, and persisting URL parameters via query, hash, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, breakpoints, animations, and plugins including typography and container queries.",
  "project_state.json": "Captures project metadata, architecture notes, known issues, and feature definitions for the app."
}