{
  "kind": "build_request",
  "title": "Show uploaded entry images as thumbnails in Recent Posts and support camera capture",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-58",
      "text": "Update the Dashboard \"Recent Posts\" table to display each entry’s uploaded image attachment as a small thumbnail, so the user can visually identify the graphic used for that post.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Make sure the image shows up as a small thumbnail in my 'Recent Posts' list!"
        ]
      },
      "acceptanceCriteria": [
        "When an entry has an image attachment, the Recent Posts table renders a thumbnail (small, consistent size) for that entry.",
        "When an entry has no image attachment, the table renders a clear empty state in that thumbnail spot (e.g., an em dash or placeholder) without breaking layout.",
        "Thumbnails use the entry’s existing attachment direct URL (no additional backend endpoints required) and load correctly after creating/updating an entry (React Query cache remains in sync).",
        "The table remains readable and mobile-responsive; thumbnail rendering does not cause horizontal overflow beyond existing behavior."
      ]
    },
    {
      "id": "REQ-59",
      "text": "In the Add/Edit Entry form’s Image Upload field, ensure mobile users can take a photo directly from their device camera as well as upload from their library, while keeping all user-facing text in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "I want to be able to upload or take a photo of the graphic I am using for each post"
        ]
      },
      "acceptanceCriteria": [
        "On supported mobile browsers, the Image Upload control offers the option to capture a new photo from the camera (in addition to choosing an existing image).",
        "Existing behaviors remain intact: selected filename display, preview when possible, and ability to clear/replace the image before saving.",
        "All visible labels/help text related to image upload remain in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn UI components are read-only and must be composed).",
    "Keep the backend architecture as a single Motoko actor; do not introduce additional backend services."
  ],
  "nonGoals": [
    "Do not redesign the overall Dashboard layout beyond adding a thumbnail column/thumbnail area in the existing Recent Posts table.",
    "Do not add new image processing features (cropping, resizing UI, filters)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}