{
  "kind": "build_request",
  "title": "Fix stopped-canister and sign-in accessibility issues; deploy current draft to Live",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-42",
      "text": "Update backend authorization so the Dashboard and Hook Template Library are fully usable without signing in (no Internet Identity and no admin token), meaning the backend methods used by these pages must not trap with \"Unauthorized\" for anonymous callers.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Fix the stopped‑canister and sign‑in issues. Make Dashboard and Hook Library fully accessible without sign‑in."
        ]
      },
      "acceptanceCriteria": [
        "Anonymous callers can successfully call `listEntries`, `getFollowUpToday`, `getGroupResponseSummary`, and `getGroupNotes` without receiving an Unauthorized trap.",
        "Anonymous callers can successfully call `createEntry`, `updateEntry`, `deleteEntry`, and `setGroupNotes` without receiving an Unauthorized trap.",
        "Anonymous callers can successfully call `getHookTemplatesForCaller` and `saveHookTemplates` without receiving an Unauthorized trap.",
        "Existing authenticated/admin behavior continues to work (authenticated users and admins still can access the same methods).",
        "No changes break existing entry fields, including Craft Category, Type of Interest, and optional image attachment support."
      ]
    },
    {
      "id": "REQ-43",
      "text": "Ensure the frontend keeps Dashboard and Hook Template Library accessible in anonymous mode (no sign-in wall), while retaining the existing sticky Dashboard header with the \"Add Entry\" button, and keeping the Craft Category dropdown and Image Upload field in the Add/Edit Entry form.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Make Dashboard and Hook Library fully accessible without sign‑in. Keep the Sticky Add Entry button. Keep the Craft Category dropdown and Image Upload field."
        ]
      },
      "acceptanceCriteria": [
        "In a fresh session with no Internet Identity login and no admin token, Dashboard renders its main content (charts/cards/table) and can load data when the backend is available.",
        "In a fresh session with no Internet Identity login and no admin token, Hook Template Library renders its main content and can load/save templates when the backend is available.",
        "Dashboard header remains sticky on mobile and the \"Add Entry\" button remains visible and functional.",
        "Entry form still includes a required Craft Category dropdown and an Image Upload field, and these remain functional in create/update flows."
      ]
    },
    {
      "id": "REQ-44",
      "text": "Resolve the stopped-canister availability issue for Live by ensuring the backend canister is running/restarted and that the deployed frontend uses the backend health check to show a clear \"Backend Service Unavailable\" state only when the canister is stopped/unreachable, with a Retry action that re-attempts loading.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "fix the stopped‑canister ... issues",
          "Then deploy this draft to Live."
        ]
      },
      "acceptanceCriteria": [
        "When the backend canister is stopped/unreachable, both Dashboard and Hook Template Library show the existing \"Backend Service Unavailable\" error state with a working Retry action.",
        "When the backend canister is running, the frontend health check succeeds and normal data queries proceed without showing the stopped-canister error state.",
        "Live environment no longer shows persistent \"Canister is stopped\" errors during normal use when the canister is running."
      ]
    },
    {
      "id": "REQ-45",
      "text": "Deploy the current draft build to Live after applying the above fixes, and perform a quick smoke test in Live to confirm: (1) Dashboard and Hook Template Library are usable without sign-in, (2) Dashboard header is sticky with \"Add Entry\", and (3) the Entry form includes Craft Category and Image Upload.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Apply all my current draft changes ... Then deploy this draft to Live."
        ]
      },
      "acceptanceCriteria": [
        "Live environment loads the latest frontend build.",
        "Backend canister is running in Live and responds to `health()` with `true`.",
        "Smoke test in Live confirms Dashboard and Hook Template Library function without signing in.",
        "Smoke test in Live confirms the sticky Dashboard header and functional \"Add Entry\" button.",
        "Smoke test in Live confirms the Entry form includes Craft Category dropdown and Image Upload field and can save an entry successfully."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (single-actor architecture).",
    "Only add `backend/migration.mo` if a state migration is required; otherwise do not create a migration.",
    "Do not edit any frontend files under `frontend/src/components/ui` or other immutable paths listed in SYSTEM_CONTEXT.",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Adding new features beyond fixing accessibility/auth, stopped-canister handling, and deploying the current draft.",
    "Introducing external databases, third-party authentication providers, or non-supported backend technologies.",
    "Redesigning the UI/visual theme beyond what is required to keep existing behaviors working."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}