{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Mobile sticky Dashboard header, explicit Copy to Clipboard buttons, and color-coded response status badges",
  "requirements": [
    {
      "id": "REQ-28",
      "summary": "Make the DashboardPage header (including Add Entry) sticky on mobile so it stays visible while scrolling without overlapping content.",
      "acceptanceCriteria": [
        "On the Marketing Tracker (Dashboard) page, when the user scrolls down on a phone-sized viewport, the \"Add Entry\" button remains visible at the top of the screen.",
        "The sticky header does not visually overlap page content; content below the header remains readable and reachable (e.g., appropriate background and spacing/z-index).",
        "The existing \"Add Entry\" behavior is unchanged: tapping it opens the entry form dialog in add mode."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Wrap the existing header section in a mobile-only sticky container (e.g., sticky positioning, top offset, background, border/shadow, z-index) so the \"Add Entry\" button remains visible during scroll; ensure sticky header remains in normal document flow (no overlap) and retains existing click behavior. Uses existing shadcn-ui Button component (compose only; do not edit ui components). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Add an explicit \"Copy to Clipboard\" button next to each hook template title that copies that template’s content and disables when empty.",
      "acceptanceCriteria": [
        "Each of the 3 hook template cards shows a button labeled \"Copy to Clipboard\" in the card header area next to the hook title.",
        "Tapping \"Copy to Clipboard\" copies the corresponding template content to the clipboard using the existing clipboard flow.",
        "If the template content is empty/whitespace, the button is disabled and the app does not attempt to copy."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HookTemplateLibraryPage.tsx",
          "operation": "modify",
          "description": "Update each hook template card header button label to \"Copy to Clipboard\" (keeping it next to the hook title), ensure it continues to call the existing clipboard write flow, and keep/confirm disabled state when template content is empty/whitespace. Uses existing shadcn-ui Card and Button components (compose only; do not edit ui components). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-30",
      "summary": "Color-code Response Status badges across the Marketing Tracker UI with distinct styles per status while keeping current label text.",
      "acceptanceCriteria": [
        "In the Recent Posts table status column, Response Status badges are color-coded with at least these mappings: Leads Generated uses a green styling; No Response uses a gray styling.",
        "Active Discussion and Negative Feedback are also visually distinct from the above and from each other (no two statuses share the same color styling).",
        "The status label text remains the current user-facing terminology (e.g., \"Lead\", \"Question\", \"No Response\", \"Negative Feedback\")."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/entries/responseStatusLabels.ts",
          "operation": "modify",
          "description": "Add a shared frontend mapping helper for ResponseStatus -> badge styling (Tailwind className tokens), ensuring: LeadsGenerated=green, NoResponse=gray, ActiveDiscussion and NegativeFeedback each use distinct non-conflicting colors; keep existing user-facing labels unchanged. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/entries/EntriesTable.tsx",
          "operation": "modify",
          "description": "Replace the current Badge variant selection with the shared status->style helper so the Recent Posts status column uses consistent, color-coded badges (green for Leads Generated, gray for No Response, distinct colors for the other statuses). Uses existing shadcn-ui Badge component (compose only; do not edit ui components). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/dashboard/FollowUpTodayList.tsx",
          "operation": "modify",
          "description": "Update the follow-up list status Badge to use the same shared status->style helper so status indicators are color-coded consistently throughout the Marketing Tracker UI. Uses existing shadcn-ui Badge component (compose only; do not edit ui components). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}