{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Lead Contact Info field to outreach entry create/edit and display",
  "requirements": [
    {
      "id": "REQ-56",
      "summary": "Add a persisted “Lead Contact Info” text field to outreach entries in the UI (create/edit + visible display).",
      "acceptanceCriteria": [
        "Frontend: the Add/Edit Entry form includes a labeled text input \"Lead Contact Info\" that is saved when creating an entry and is pre-filled when editing an existing entry.",
        "Frontend: after saving, the Dashboard refreshes via existing React Query invalidation and the saved \"Lead Contact Info\" value is visible somewhere in the entry UI (either a table column, a row detail/expanded view, or an edit view that clearly shows the persisted value)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/entries/EntryFormDialog.tsx",
          "operation": "modify",
          "description": "Add a new form field (react-hook-form) for \"Lead Contact Info\" and wire it into create/update payloads: include it in FormData, reset defaults, pre-fill from editingEntry.leadContactInfo, and submit it along with the existing fields. Use existing shadcn-ui Input/Label for the new control; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useOutreachMutations.ts",
          "operation": "modify",
          "description": "Extend create/update entry mutations to accept leadContactInfo and pass it to the backend createEntry/updateEntry calls in the correct argument order (matching frontend/src/backend.d.ts). Ensure existing React Query invalidation behavior remains unchanged."
        },
        {
          "path": "frontend/src/components/entries/EntriesTable.tsx",
          "operation": "modify",
          "description": "Display the persisted leadContactInfo value in the entries UI (e.g., add a \"Lead Contact Info\" column with a readable/truncated cell). Use existing shadcn-ui Table primitives already in this file; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}